# TextElement Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextElement Class
Members See Also
---
Base class representing text elements in Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class TextElement : Element
```

Visual Basic
---
```text
Public Class TextElement _
	Inherits Element
```

Visual C++
---
```text
public ref class TextElement : public Element
```

# Remarks
TextElement is a base class for other annotation classes, like TextNote, which have additional, more specific functionality.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..TextElement Autodesk.Revit.DB..::..TextNote
# See Also
TextElement Members
Autodesk.Revit.DB Namespace